 



Mobile Ad hoc Networks Working                                S. Ratliff
Group                                             Independent Consultant
Internet-Draft                                                  B. Berry
Intended status: Standards Track                             G. Harrison
Expires: April 2, 2015                                           S. Jury
                                                           Cisco Systems
                                                          D. Satterwhite
                                                                Broadcom
                                                        October 24, 2014


                 Dynamic Link Exchange Protocol (DLEP)
                        draft-ietf-manet-dlep-07

Abstract

   When routing devices rely on modems to effect communications over
   wireless links, they need timely and accurate knowledge of the
   characteristics of the link (speed, state, etc.) in order to make
   forwarding decisions. In mobile or other environments where these
   characteristics change frequently, manual configurations or the
   inference of state through routing or transport protocols does not
   allow the router to make the best decisions. A bidirectional, event-
   driven communication channel between the router and the modem is
   necessary.

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on August 14, 2014.
 


Ratliff et al.           Expires April 27, 2015                 [Page 1]

Internet-Draft                    DLEP                      October 2014


Copyright Notice

   Copyright (c) 2012 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document. Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1. Introduction  . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.1  Requirements  . . . . . . . . . . . . . . . . . . . . . . .  8
   2. Assumptions . . . . . . . . . . . . . . . . . . . . . . . . . .  8
   3. Mandatory Versus Optional Items . . . . . . . . . . . . . . . .  9
   4. Credits . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10
   5. Metrics . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10
   6. Extensions to DLEP  . . . . . . . . . . . . . . . . . . . . . . 11
     6.1 Protocol Extensions  . . . . . . . . . . . . . . . . . . . . 11
     6.2 Vendor Extensions  . . . . . . . . . . . . . . . . . . . . . 11
     6.3 Experimental Extensions  . . . . . . . . . . . . . . . . . . 11
   7.  Normal Session Flow  . . . . . . . . . . . . . . . . . . . . . 12
     7.1 DLEP Router session flow - Discovery case  . . . . . . . . . 12
     7.2 DLEP Router session flow - Configured case . . . . . . . . . 12
     7.3  DLEP Modem session flow . . . . . . . . . . . . . . . . . . 13
     7.4  Common Session Flow . . . . . . . . . . . . . . . . . . . . 14
   8. Mandatory Signals and Data Items  . . . . . . . . . . . . . . . 14
   9. Generic DLEP Signal Definition  . . . . . . . . . . . . . . . . 16
   10. DLEP Data Items  . . . . . . . . . . . . . . . . . . . . . . . 16
     10.1  DLEP Version . . . . . . . . . . . . . . . . . . . . . . . 17
     10.2  DLEP Port  . . . . . . . . . . . . . . . . . . . . . . . . 18
     10.3  Peer Type  . . . . . . . . . . . . . . . . . . . . . . . . 18
     10.4  MAC Address  . . . . . . . . . . . . . . . . . . . . . . . 19
     10.5  IPv4 Address . . . . . . . . . . . . . . . . . . . . . . . 19
     10.6  IPv6 Address . . . . . . . . . . . . . . . . . . . . . . . 20
     10.7  Maximum Data Rate (Receive)  . . . . . . . . . . . . . . . 21
     10.8  Maximum Data Rate (Transmit) . . . . . . . . . . . . . . . 22
     10.9  Current Data Rate (Receive)  . . . . . . . . . . . . . . . 22
     10.10  Current Data Rate (Transmit)  . . . . . . . . . . . . . . 23
     10.11  Latency . . . . . . . . . . . . . . . . . . . . . . . . . 24
     10.12  Resources (Receive) . . . . . . . . . . . . . . . . . . . 25
     10.13  Resources (Transmit)  . . . . . . . . . . . . . . . . . . 25
 


Ratliff et al.           Expires April 27, 2015                 [Page 2]

Internet-Draft                    DLEP                      October 2014


     10.14  Relative Link Quality (Receive) . . . . . . . . . . . . . 26
     10.15  Relative Link Quality (Transmit)  . . . . . . . . . . . . 27
     10.16  Status  . . . . . . . . . . . . . . . . . . . . . . . . . 27
     10.17  Heartbeat Interval  . . . . . . . . . . . . . . . . . . . 28
     10.18  Link Characteristics ACK Timer  . . . . . . . . . . . . . 28
     10.19  Credit Window Status  . . . . . . . . . . . . . . . . . . 29
     10.20  Credit Grant Request  . . . . . . . . . . . . . . . . . . 30
     10.21  Credit Request  . . . . . . . . . . . . . . . . . . . . . 31
     10.22  DLEP Optional Signals Supported . . . . . . . . . . . . . 31
     10.23  DLEP Optional Data Items Supported  . . . . . . . . . . . 32
     10.24  DLEP Vendor Extension . . . . . . . . . . . . . . . . . . 33
     10.25  IPv4 Attached Subnet  . . . . . . . . . . . . . . . . . . 33
     10.26  IPv6 Attached Subnet  . . . . . . . . . . . . . . . . . . 34
   11. DLEP Protocol Signals  . . . . . . . . . . . . . . . . . . . . 35
     11.1  Signal TLV Values  . . . . . . . . . . . . . . . . . . . . 35
     11.2 Peer Discovery Signal . . . . . . . . . . . . . . . . . . . 36
     11.3 Peer Offer Signal . . . . . . . . . . . . . . . . . . . . . 36
     11.4 Peer Initialization Signal  . . . . . . . . . . . . . . . . 37
     11.5 Peer Initialization ACK Signal  . . . . . . . . . . . . . . 37
     11.6 Peer Update Signal  . . . . . . . . . . . . . . . . . . . . 38
     11.7 Peer Update ACK Signal  . . . . . . . . . . . . . . . . . . 39
     11.8 Peer Termination Signal . . . . . . . . . . . . . . . . . . 40
     11.9 Peer Termination ACK Signal . . . . . . . . . . . . . . . . 40
     11.10 Destination Up Signal  . . . . . . . . . . . . . . . . . . 40
     11.11 Destination Up ACK Signal  . . . . . . . . . . . . . . . . 41
     11.12 Destination Down Signal  . . . . . . . . . . . . . . . . . 41
     11.13 Destination Down ACK Signal  . . . . . . . . . . . . . . . 42
     11.14 Destination Update Signal  . . . . . . . . . . . . . . . . 42
     11.15 Heartbeat Signal . . . . . . . . . . . . . . . . . . . . . 43
     11.16 Link Characteristics Request Signal  . . . . . . . . . . . 43
     11.17 Link Characteristics ACK Signal  . . . . . . . . . . . . . 44
   12.  Security Considerations . . . . . . . . . . . . . . . . . . . 45
   13.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . 45
     13.1  Registrations  . . . . . . . . . . . . . . . . . . . . . . 45
     13.2  Expert Review: Evaluation Guidelines . . . . . . . . . . . 45
     13.3  Signal TLV Type Registration . . . . . . . . . . . . . . . 45
     13.4  DLEP Data Item Registrations . . . . . . . . . . . . . . . 46
     13.5  DLEP Well-known Port . . . . . . . . . . . . . . . . . . . 47
     13.6  DLEP Multicast Address . . . . . . . . . . . . . . . . . . 47
   14. Appendix A.  . . . . . . . . . . . . . . . . . . . . . . . . . 47
     14.1  Peer Level Signal Flows  . . . . . . . . . . . . . . . . . 47
       14.1.1  Router Device Restarts Discovery . . . . . . . . . . . 47
       14.1.2  Router Device Detects Peer Offer Timeout . . . . . . . 48
       14.1.3  Router Peer Offer Lost . . . . . . . . . . . . . . . . 49
       14.1.4  Discovery Success  . . . . . . . . . . . . . . . . . . 49
       14.1.5  Router Detects a Heartbeat timeout . . . . . . . . . . 50
       14.1.6  Modem Detects a Heartbeat timeout  . . . . . . . . . . 50
       14.1.7  Peer Terminate (from Modem) Lost . . . . . . . . . . . 51
 


Ratliff et al.           Expires April 27, 2015                 [Page 3]

Internet-Draft                    DLEP                      October 2014


       14.1.8  Peer Terminate (from Router) Lost  . . . . . . . . . . 51
     14.2  Destination Specific Signal Flows  . . . . . . . . . . . . 51
       14.2.1  Modem Destination Up Lost  . . . . . . . . . . . . . . 52
       14.2.2  Router Detects Duplicate Destination Ups . . . . . . . 52
       14.2.3  Destination Up, No Layer 3 Addresses . . . . . . . . . 53
       14.2.4  Destination Up with IPv4, No IPv6  . . . . . . . . . . 53
       14.2.5  Destination Up with IPv4 and IPv6  . . . . . . . . . . 53
       14.2.6  Destination Session Success  . . . . . . . . . . . . . 54
   Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . . . 54
   Normative References . . . . . . . . . . . . . . . . . . . . . . . 55
   Informative References . . . . . . . . . . . . . . . . . . . . . . 55
   Author's Addresses . . . . . . . . . . . . . . . . . . . . . . . . 55

1. Introduction

   There exist today a collection of modem devices that control links of
   variable datarate and quality. Examples of these types of links
   include line-of-sight (LOS) terrestrial radios, satellite terminals,
   and cable/DSL modems. Fluctuations in speed and quality of these
   links can occur due to configuration (in the case of cable/DSL
   modems), or on a moment-to-moment basis, due to physical phenomena
   like multipath interference, obstructions, rain fade, etc. It is also
   quite possible that link quality and datarate varies with respect to
   individual destinations on a link, and with the type of traffic being
   sent. As an example, consider the case of an 802.11g access point,
   serving 2 associated laptop computers. In this environment, the
   answer to the question "What is the datarate on the 802.11g link?" is
   "It depends on which associated laptop we're talking about, and on
   what kind of traffic is being sent." While the first laptop, being
   physically close to the access point, may have a datarate of 54Mbps
   for unicast traffic, the other laptop, being relatively far away, or
   obstructed by some object, can simultaneously have a datarate of only
   32Mbps for unicast. However, for multicast traffic sent from the
   access point, all traffic is sent at the base transmission rate
   (which is configurable, but depending on the model of the access
   point, is usually 24Mbps or less). 

   In addition to utilizing variable datarate links, mobile networks are
   challenged by the notion that link connectivity will come and go over
   time, without an effect on a router's interface state (Up or Down). 
   Effectively utilizing a relatively short-lived connection is
   problematic in IP routed networks, as routing protocols tend to rely
   on interface state and independent timers at OSI Layer 3 to maintain
   network convergence (e.g. HELLO messages and/or recognition of DEAD
   routing adjacencies). These dynamic connections can be better
   utilized with an event-driven paradigm, where acquisition of a new
   neighbor (or loss of an existing one) is signaled, as opposed to a
   paradigm driven by timers and/or interface state.
 


Ratliff et al.           Expires April 27, 2015                 [Page 4]

Internet-Draft                    DLEP                      October 2014


   Another complicating factor for mobile networks are the different
   methods of physically connecting the modem devices to the router.
   Modems can be deployed as an interface card in a router's chassis, or
   as a standalone device connected to the router via Ethernet or serial
   link. In the case of Ethernet or serial attachment, with existing
   protocols and techniques, routing software cannot be aware of
   convergence events occurring on the radio link (e.g. acquisition or
   loss of a potential routing neighbor), nor can the router be aware of
   the actual capacity of the link. This lack of awareness, along with
   the variability in datarate, leads to a situation where finding the
   (current) best route through the network to a given destination is
   difficult to establish and properly maintain. This is especially true
   of demand-based access schemes such as Demand Assigned Multiple
   Access (DAMA) implementations used on some satellite systems. With a
   DAMA-based system, additional datarate may be available, but will not
   be used unless the network devices emit traffic at rate higher than
   the currently established rate. Increasing the traffic rate does not
   guarantee additional datarate will be allocated; rather, it may
   result in data loss and additional retransmissions on the link. 

   Addressing the challenges listed above, the authors have developed
   the Data Link Exchange Protocol, or DLEP. The DLEP protocol runs
   between a router and its attached modem devices, allowing the modem
   to communicate link characteristics as they change, and convergence
   events (acquisition and loss of potential routing destinations). The
   following diagrams are used to illustrate the scope of DLEP packets.

   |-------Local Node-------|          |-------Remote Node------|
   |                        |          |                        |
   +--------+       +-------+          +-------+       +--------+
   | Router |=======| Modem |{~~~~~~~~}| Modem |=======| Router |
   |        |       | Device|          | Device|       |        |
   +--------+       +-------+          +-------+       +--------+
            |       |       | Link     |       |       |
            |-DLEP--|       | Protocol |       |-DLEP--|
            |       |       | (e.g.    |       |       |
            |       |       | 802.11)  |       |       |

                          Figure 1: DLEP Network

   In Figure 1, when the local modem detects the presence of a remote
   node, it (the local modem) sends a signal to its router via the DLEP
   protocol. Upon receipt of the signal, the local router may take
   whatever action it deems appropriate, such as initiating discovery
   protocols, and/or issuing HELLO messages to converge the network. On
   a continuing, as-needed basis, the modem devices utilize DLEP to
   report any characteristics of the link (datarate, latency, etc) that
   have changed. DLEP is independent of the link type and topology
 


Ratliff et al.           Expires April 27, 2015                 [Page 5]

Internet-Draft                    DLEP                      October 2014


   supported by the modem. Note that the DLEP protocol is specified to
   run only on the local link between router and modem. Some over the
   air signaling may be necessary between the local and remote modem in
   order to provide some parameters in DLEP signals between the local
   modem and local router, but DLEP does not specify how such over the
   air signaling is carried out. Over the air signaling is purely a
   matter for the modem implementer. 

   Figure 2 shows how DLEP can support a configuration where routers are
   connected with different link types. In this example, Modem A
   implements a point-to-point link, and Modem B is connected via a
   shared medium. In both cases, the DLEP protocol is used to report the
   characteristics of the link (datarate, latency, etc.) to routers. The
   modem is also able to use the DLEP session to notify the router when
   the remote node is lost, shortening the time required to re-converge
   the network.



            +--------+                     +--------+
       +----+ Modem A|                     | Modem A+---+
       |    | Device |  <===== // ======>  | Device |   |
       |    +--------+      P-2-P Link     +--------+   |
   +---+----+                                       +---+----+
   | Router |                                       | Router |
   |        |                                       |        |
   +---+----+                                       +---+----+
       |     +--------+                     +--------+  |
       +-----+ Modem B|                     | Modem B|  |
             | Device |   o o o o o o o o   | Device +--+
             +--------+    o  Shared   o    +--------+
                            o Medium  o
                             o       o
                              o     o
                               o   o
                                 o
                            +--------+
                            | Modem B|
                            | Device |
                            +---+----+
                                |
                                |
                            +---+----+
                            | Router |
                            |        |
                            +--------+

            Figure 2: DLEP Network with Multiple Modem Devices
 


Ratliff et al.           Expires April 27, 2015                 [Page 6]

Internet-Draft                    DLEP                      October 2014


   DLEP defines a set of signals used by modems and their attached
   routers. The signals are used to communicate events that occur on the
   physical link(s) managed by the modem: for example, a remote node
   entering or leaving the network, or that the link has changed.
   Associated with these signals are a set of data items - information
   that describes the remote node (e.g., address information), and/or
   the characteristics of the link to the remote node.  

   The protocol is defined as a collection of type-length-value (TLV)
   based formats, specifying the signals that are exchanged between a
   router and a modem, and the data items associated with the signal.
   This document specifies transport of DLEP signals and data items via
   the TCP transport, with a UDP-based discovery mechanism. Other
   transports for the protocol are possible, but are outside the scope
   of this document.

   DLEP signals are further defined as mandatory or optional. Signals
   will additionally have mandatory and optional data items.
   Implementations MUST support all mandatory signals and their
   mandatory data items to be considered compliant. Implementations MAY
   also support some, or all, of the optional signals and data items. 

   DLEP uses a session-oriented paradigm between the modem device and
   its associated router. If multiple modem devices are attached to a
   router (as in Figure 2), a separate DLEP session MUST exist for each
   modem. If a modem device supports multiple connections to a router
   (via multiple logical or physical interfaces), or supports
   connections to multiple routers, a separate DLEP session MUST exist
   for each connection. This router/modem session provides a carrier for
   information exchange concerning "destinations" that are available via
   the modem device. A "destination" can be either physical (as in the
   case of a specific far-end router), or a logical destination (as in a
   Multicast group). As such, all of the destination-level exchanges in
   DLEP can be envisioned as building an information base concerning the
   remote nodes, and the link characteristics to those nodes. 

   Any DLEP signal that is NOT understood by a receiver MUST result in
   an error indication being sent to the originator, and also MUST
   result in termination of the session between the DLEP peers. Any data
   item that is NOT understood by a receiver MUST be ignored. 

   Multicast traffic destined for the variable-quality network (the
   network accessed via the DLEP modem) is handled in IP networks by
   deriving a Layer 2 MAC address based on the Layer 3 address.
   Leveraging on this scheme, Multicast traffic is supported in DLEP
   simply by treating the derived MAC address as any other "destination"
   (albeit a logical one) in the network. To support these logical
   destinations, one of the DLEP participants (typically, the router)
 


Ratliff et al.           Expires April 27, 2015                 [Page 7]

Internet-Draft                    DLEP                      October 2014


   informs the other as to the existence of the logical neighbor. The
   modem, once it is aware of the existence of this logical neighbor,
   reports link characteristics just as it would for any other
   destination in the network. The specific algorithms a modem would use
   to report metrics on multicast (or logical) destinations is outside
   the scope of this specification, and is left to specific
   implementations to decide. 

1.1  Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14, RFC 2119
   [RFC2119].

2. Assumptions

   Routers and modems that exist as part of the same node (e.g., that
   are locally connected) can utilize a discovery technique to locate
   each other, thus avoiding a-priori configuration. The router is
   responsible for initialing the discovery process, using the Peer
   Discovery signal. 

   DLEP utilizes a session-oriented paradigm. A router and modem form a
   session by completing the discovery process. This router-modem
   session persists unless or until it either (1) times out, based on
   the timeout values supplied, or (2) is explicitly torn down by one of
   the participants. Note that while use of timers in DLEP is OPTIONAL,
   it is strongly recommended that implementations choose to run with
   timers enabled. 

   DLEP assumes that participating modems, and their physical links, act
   as a transparent IEEE 802.1D bridge. Specifically, the assumption is
   that the destination MAC address for data traffic (frames destined
   for the far-end node, as opposed to the DLEP control traffic itself)
   in any frame emitted by the router should be the MAC address of a
   device in the remote node. DLEP also assumes that MAC addresses are
   unique within the context of the router-modem session.

   DLEP utilizes UDP multicast for single-hop discovery, and TCP for
   transport of the control signals. Therefore, DLEP assumes that the
   modem and router have topologically consistent IP addresses assigned.
   It is recommended that DLEP implementations utilize IPv6 link-local
   addresses to reduce the administrative burden of address assignment. 

   This document refers to a remote node as a "Destination".
   Destinations can be identified by either the router or the modem, and
   represent a specific destination (e.g., an address) that exists on
 


Ratliff et al.           Expires April 27, 2015                 [Page 8]

Internet-Draft                    DLEP                      October 2014


   the link(s) managed by the modem. A destination MUST contain a MAC
   address, it MAY optionally include a Layer 3 address (or addresses).
   Destinations MAY refer either to physical devices in the network, or
   to logical destinations, as in a derived multicast MAC address
   associated with a group. As "destinations" are discovered, DLEP
   routers and modems build an information base on destinations
   accessible via the modem. Changes in link characteristics MAY then be
   reported as being "modem-wide" (effecting ALL destinations accessed
   via the modem) or MAY be neighbor (destination) specific. 

   The DLEP signals concerning destinations thus become the way for
   routers and modems to maintain, and notify each other about, an
   information base representing the physical and logical (e.g.,
   multicast) destinations accessible via the modem device. The
   information base would contain addressing information (e.g., MAC
   address, and OPTIONALLY, Layer 3 addresses), link characteristics
   (metrics), and OPTIONALLY, flow control information (credits). 

   DLEP assumes that security on the session (e.g. authentication of
   session partners, encryption of traffic, or both) is dealt with by
   the underlying transport mechanism (e.g., by using a transport such
   as TLS [TLS]).

   This document specifies an implementation of the DLEP signals and
   data items running over the TCP transport. It is assumed that DLEP
   running over other transport mechanisms would be documented
   separately.


3. Mandatory Versus Optional Items

   As mentioned above, DLEP defines a core set of signals and data items
   as mandatory. Support for those signals and data items MUST exist in
   an implementation to guarantee interoperability and therefore make an
   implementation DLEP compliant. However, a mandatory signal or data
   item is not necessarily required - as an example, consider the data
   item entitled "DLEP Optional Signals Supported", defined in section
   10.22 of this document. The data item allows a DLEP implementation to
   list all optional behavior it supports, and is sent as a part of the
   Peer Initialization signal. Receiving implementations MUST be capable
   of parsing and understanding the optional signals that are offered.
   However, if the sending implementation has chosen NOT to implement
   ANY optional functionality, this data item would NOT be included in
   the Peer Initialization. Although parsing and understanding the data
   item is a mandatory function of a compliant DLEP, the data item
   itself MAY, or MAY NOT, appear in the flow. Absence of the mandatory
   data item would not be considered a protocol error, but as support
   for the core DLEP signals ONLY. Therefore, care should be taken to
 


Ratliff et al.           Expires April 27, 2015                 [Page 9]

Internet-Draft                    DLEP                      October 2014


   differentiate the notion of a mandatory data item versus one that
   MUST appear in a given message.


4. Credits

   DLEP includes an OPTIONAL credit-windowing scheme analogous to the
   one documented in [RFC5578]. In this scheme, traffic between the
   router and modem is treated as two unidirectional windows. This
   document identifies these windows as the "Modem Receive Window", or
   MRW, and the "Router Receive Window", or RRW.

   If the OPTIONAL credit-windowing scheme is used, credits MUST be
   granted by the receiver on a given window - that is, on the "Modem
   Receive Window" (MRW), the modem is responsible for granting credits
   to the router, allowing it (the router) to send data to the modem.
   Likewise, the router is responsible for granting credits on the RRW,
   which allows the modem to send data to the router.

   DLEP expresses all credit data in number of octets. The total number
   of credits on a window, and the increment to add to a grant, are
   always expressed as a 64-bit unsigned quantity.

   If used, credits are managed on a neighbor-specific basis; that is,
   separate credit counts are maintained for each neighbor requiring the
   service. Credits do not apply to the DLEP session that exists between
   routers and modems.

5. Metrics

   DLEP includes the ability for the router and modem to communicate
   metrics that reflect the characteristics (e.g. datarate, latency) of
   the variable-quality link in use. DLEP does NOT specify how a given
   metric value is to be calculated, rather, the protocol assumes that
   metrics have been calculated with a "best effort", incorporating all
   pertinent data that is available to the modem device.

   As mentioned in the introduction section of this document, metrics
   have to be used within a context - for example, metrics to a unicast
   address in the network. DLEP allows for metrics to be sent within two
   contexts - metrics for a specific destination within the network
   (e.g., a specific router), and "modem-wide" (those that apply to all
   destinations accessed via the modem). Metrics can be further
   subdivided into transmit and receive metrics. Metrics supplied on
   DLEP Peer signals are, by definition, modem-wide; metrics supplied on
   Destination signals are, by definition, used for the specific
   neighbor only.

 


Ratliff et al.           Expires April 27, 2015                [Page 10]

Internet-Draft                    DLEP                      October 2014


   DLEP modem implementations MUST announce all supported metric items,
   and provide default values for those metrics, in the Peer
   Initialization signal. In order to introduce a new metric type, DLEP
   modem implementations MUST terminate the session with the router (via
   the Peer Terminate signal), and re-establish the session. 

   It is left to implementations to choose sensible default values based
   on their specific characteristics. Modems having static (non-
   changing) link metric characteristics MAY report metrics only once
   for a given neighbor (or once on a modem-wide basis, if all
   connections via the modem are of this static nature).

   The approach of allowing for different contexts for metric data
   increases both the flexibility and the complexity of using metric
   data. This document details the mechanism whereby the data is
   transmitted, however, the specific algorithms (precedence, etc) for
   utilizing the dual-context metrics is out of scope and not addressed
   by this document.  

6. Extensions to DLEP

   While this draft represents the best efforts of the co-authors, and
   the working group, to be functionally complete, it is recognized that
   extensions to DLEP will in all likelihood be necessary as more link
   types are utilized. There are three possible avenues for DLEP
   extensions: protocol extensions, vendor extensions, and experimental
   extensions.

6.1 Protocol Extensions

   If/when protocol extensions are required, they should be standardized
   either as an update to this document, or as an additional stand-alone
   specification.


6.2 Vendor Extensions

   Vendor extensions to DLEP are accommodated via the "DLEP Vendor
   Extension" TLV, documented in Section 10.22 of this document. If a
   perceived extension exceeds the scope of what can be contained in the
   DLEP Vendor Extension TLV, the proposed extension should be addressed
   as either an update to this document, or as a stand-alone
   specification.


6.3 Experimental Extensions

   This document requests numbering space in both the Signal and Data
 


Ratliff et al.           Expires April 27, 2015                [Page 11]

Internet-Draft                    DLEP                      October 2014


   Item registries for experimental items. The intent is to allow for
   experimentation with new signals and/or data items, while still
   retaining the documented DLEP behavior. If a given experiment proves
   successful, it SHOULD be documented as an update to this document, or
   as a stand-alone specification. Experimental DLEP signals SHOULD be
   treated as optional signals - e.g., they SHOULD be announced in the
   "DLEP Optional Signals TLV" in Peer Initialization and/or Peer
   Initialization ACK. Likewise, experimental data item TLVs SHOULD be
   announced in the "DLEP Optioinal Data Items" TLV (also in Peer
   Initialization/Peer Initialization ACK).


7.  Normal Session Flow

   Normal session flow for a DLEP router has two sub-cases, depending on
   whether the implementation supports the discovery process. Since
   modems MUST support the discovery process, there is only one
   description necessary for modem implementations. The normal flow by
   DLEP partner type is: 

7.1 DLEP Router session flow - Discovery case

   If the DLEP router implementation is utilizing the optional discovery
   mechanism, then the implementation will initialize a UDP socket,
   binding it to an arbitrary port. This UDP socket is used to send the
   Peer Discovery signal to the DLEP link-local multicast address and
   port (TBD). The implementation then waits on receipt of a Peer Offer
   signal, which MUST contain the unicast address and port for TCP-based
   communication with a DLEP modem. The Peer Offer signal MAY contain
   multiple address/port combinations. If more than one address/port
   combination is in the Peer Offer, the DLEP router implementation
   SHOULD consider the list to be in priority sequence, with the "most
   desired" address/port combination listed first. However, router
   implementations MAY use their own heuristics to determine the best
   address/port combination. At this point, the router implementation
   MAY either destroy the UDP socket, or continue to issue Peer
   Discovery signals to the link-local address/port combination. In
   either case, the TCP session initialization occurs as in the
   configured case. 

7.2 DLEP Router session flow - Configured case

   When a DLEP router implementation has the address and port
   information for a TCP connection to a modem (obtained either via
   configuration or via the discovery process described above), the
   router will initialize and bind a TCP socket. This socket is used to
   connect to the DLEP modem software. After a successful TCP connect,
   the modem implementation MUST issue a Peer Initialization signal to
 


Ratliff et al.           Expires April 27, 2015                [Page 12]

Internet-Draft                    DLEP                      October 2014


   the DLEP router. The Peer Initialization signal MUST contain TLVs for
   ALL supported metrics from this modem (e.g. all mandatory metrics
   plus all optional metrics supported by the implementation), along
   with the default values of those metrics. After sending the Peer
   Initialization, the modem implementation MUST wait for receipt of a
   Peer Initialization ACK signal from the router. Receipt of the Peer
   Initialization ACK indicates that the router has received and
   processed the Peer Initialization, and the session MUST transition to
   the "in session" state. At this point, signals regarding destinations
   in the network, and/or Peer Update signals, can flow on the DLEP
   session between modem and router. The "in session" state is
   maintained until one of the following conditions occur:

   o  The session is explicitly terminated (using Peer Termination), or
   o  The session times out, based on supplied timeout values. 


7.3  DLEP Modem session flow

   DLEP modem implementations MUST support the discovery mechanism.
   Therefore, the normal flow is as follows: 

   The implementation will initialize a UDP socket, binding that socket
   to the DLEP link-local multicast address (TBD) and the DLEP well-
   known port number (also TBD). The implementation will then initialize
   a TCP socket, on a unicast address and port. This socket is used to
   listen for incoming TCP connection requests.

   When the modem implementation receives a Peer Discovery signal on the
   UDP socket, it responds by issuing a Peer Offer signal to the sender
   of the Peer Discovery. The Peer Offer signal MUST contain the unicast
   address and port of the TCP listen socket, described above. A DLEP
   modem implementation MAY respond with ALL address/port combinations
   that have an active TCP listen posted. If multiple address/port
   combinations are listed, the receiver of the Peer Offer MAY connect
   on any available address/port pair. Anything other than Peer
   Discovery signals received on the UDP socket MUST be silently
   dropped.

   When the DLEP modem implementation accepts a connection via TCP, it
   MUST send a Peer Initialization signal. The Peer Initialization MUST
   contain metric TLVs for ALL mandatory metrics, and MUST contain
   metric TLVs for ANY optional metrics supported by the modem. If a new
   metric is to be introduced, the DLEP session between router and modem
   MUST be terminated and restarted, and the new metric described in a
   Peer Initialization signal. 


 


Ratliff et al.           Expires April 27, 2015                [Page 13]

Internet-Draft                    DLEP                      October 2014


7.4  Common Session Flow

   In order to maintain the session between router and modem, periodic
   "Heartbeat" signals MAY be exchanged. These signals are intended to
   keep the session alive, and to verify bidirectional connectivity
   between the two participants. DLEP also provides an OPTIONAL Peer
   Update signal, intended to communicate some change in status (e.g., a
   change of layer 3 address parameters, or a modem-wide link change).

   In addition to the local (Peer level) signals above, the participants
   will transmit DLEP signals concerning destinations in the network.
   These signals trigger creation/maintenance/deletion of destinations
   in the information base of the recipient. For example, a modem will
   inform its attached router of the presence of a new destination via
   the "Destination Up" signal. Receipt of a Destination Up causes the
   router to allocate the necessary resources, creating an entry in the
   information base with the specifics (e.g., MAC Address, Latency, Data
   Rate, etc) of the neighbor. The loss of a destination is communicated
   via the "Destination Down" signal, and changes in status to the
   destination (e.g. varying link quality, or addressing changes) are
   communicated via the "Destination Update" signal. The information on
   a given neighbor will persist in the router's information base until
   (1) a "Destination Down" is received, indicating that the modem has
   lost contact with the remote node, or (2) the router/modem session
   terminates, indicating that the router has lost contact with its own
   local modem. 

   Again, metrics can be expressed within the context of a specific
   neighbor via the Destination Update signal, or on a modem-wide basis
   via the Peer Update signal. In cases where metrics are provided on
   the router/modem session, the receiver MUST propagate the metrics to
   all destinations in its information base that are accessed via the
   originator. A DLEP participant MAY send metrics both in a
   router/modem session context (via the Peer Update signal) and a
   specific neighbor context (via Destination Update) at any time. The
   heuristics for applying received metrics is left to implementations.

   In addition to receiving metrics about the link, DLEP provides an
   OPTIONAL signal allowing a router to request a different datarate, or
   latency, from the modem. This signal is referred to as the Link
   Characteristics Signal, and gives the router the ability to deal with
   requisite increases (or decreases) of allocated datarate/latency in
   demand-based schemes in a more deterministic manner.

8. Mandatory Signals and Data Items

   The following DLEP signals are considered core to the specification;
   implementations MUST support these signals, and the associated data
 


Ratliff et al.           Expires April 27, 2015                [Page 14]

Internet-Draft                    DLEP                      October 2014


   items, in order to be considered compliant:

         Signal                        Data Items
         ======                        ==========
         Peer Discovery (Router Only)  None

         Peer Offer (Modem Only)       IPv4 Address
                                       IPv6 address
                                       DLEP Port

         Peer Initialization           Maximum Data Rate (Receive)
                                       Maximum Data Rate (Transmit)
                                       Current Data Rate (Receive)
                                       Current Data Rate (Transmit)
                                       Latency
                                       Relative Link Quality (Receive)
                                       Relative Link Quality (Transmit)
                                       DLEP Optional Signal Support
                                       DLEP Optional Data Item Support

         Peer Initialization ACK       Status

         Peer Termination              Status

         Peer Termination ACK          Status 

         Destination Up                MAC Address
                                       Maximum Data Rate (Receive)
                                       Maximum Data Rate (Transmit)
                                       Current Data Rate (Receive)
                                       Current Data Rate (Transmit)
                                       Latency
                                       Relative Link Quality (Receive)
                                       Relative Link Quality (Transmit)

         Destination Update            MAC Address
                                       Maximum Data Rate (Receive)
                                       Maximum Data Rate (Transmit)
                                       Current Data Rate (Receive)
                                       Current Data Rate (Transmit)
                                       Latency
                                       Relative Link Quality (Receive)
                                       Relative Link Quality (Transmit)

         Destination Down              MAC Address

   All other DLEP signals and data items are OPTIONAL. Implementations
   MAY choose to provide them. Implementations that do not support
 


Ratliff et al.           Expires April 27, 2015                [Page 15]

Internet-Draft                    DLEP                      October 2014


   optional signals MUST report an error condition and terminate the
   router/modem session upon receipt of any such signal received.
   OPTIONAL data items received that are not supported MUST be silently
   dropped.

9. Generic DLEP Signal Definition

   The Generic DLEP Signal consists of a sequence of TLVs. The first TLV
   represents the signal being communicated (e.g., a "Destination Up",
   or a "Peer Offer"). Subsequent TLVs contain the data items pertinent
   to the signal (e.g., Maximum Data Rate, or Latency, etc).

   The Generic DLEP Packet Definition contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |Signal TLV Type | Length                | DLEP data items...   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Signal               - One of the DLEP Signal TLV type values 
                             defined in this document. 

      Length               - The length, expressed as a 16-bit 
                             quantity, of all of the DLEP data items
                             associated with this signal.

      DLEP data items      - One or more data items, encoded in TLVs,
                             as defined in this document.


10. DLEP Data Items

   As mentioned earlier, DLEP protocol signals are transported as a
   collection of TLVs. The first TLV present in a DLEP signal MUST be
   one of the Signal TLVs, documented in section 10. The signals are
   followed by one or more data items, indicating the specific changes
   that need to be instantiated in the receiver's information base.

   Valid DLEP Data Items are:


          TLV      TLV
          Value    Description
          =========================================
          TBD      DLEP Port
          TBD      Peer Type 
          TBD      IPv4 Address
 


Ratliff et al.           Expires April 27, 2015                [Page 16]

Internet-Draft                    DLEP                      October 2014


          TBD      IPv6 Address
          TBD      Maximum Data Rate (Receive)  (MDRR)
          TBD      Maximum Data Rate (Transmit) (MDRT)
          TBD      Current Data Rate (Receive)  (CDRR)
          TBD      Current Data Rate (Transmit) (CDRT) 
          TBD      Latency
          TBD      Receive Resources
          TBD      Transmit Resources
          TBD      Relative Link Quality (Receive)  (RLQR)
          TBD      Relative Link Quality (Transmit) (RLQT)
          TBD      Status
          TBD      Heartbeat Interval/Threshold
          TBD      Neighbor down ACK timer
          TBD      Link Characteristics ACK timer
          TBD      Credit Window Status
          TBD      Credit Grant
          TBD      Credit Request
          TBD      DLEP Optional Signals Supported
          TBD      DLEP Optional Data Items Supported
          TBD      DLEP Vendor Extension

   DLEP data item TLVs contain the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  TLV Type     | Length        | Value...                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    - An 8-bit unsigned integer field specifying the data    
                 item being sent.

   Length      - An 8-bit length of the value field of the data item

   Value       - A field of length <Length> which contains data         
                 specific to a particular data item.


10.1  DLEP Version

      The DLEP Version TLV is a mandatory TLV in the Peer Discovery,
   Peer Initialization, and Peer Initialization ACK signals. The Version
   TLV is used to indicate the version of the protocol running in the
   originator. A DLEP implementation MAY use this information to decide
   if the potential session partner is running at a supported level.

   The DLEP Version TLV contains the following fields:

 


Ratliff et al.           Expires April 27, 2015                [Page 17]

Internet-Draft                    DLEP                      October 2014


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length=4       |         Major Version         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       Minor Version           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type      - TBD

   Length        - Length is 4

   Major Version - Major version of the modem or router protocol.

   Minor Version - Minor version of the modem or router protocol.

   Support of this draft is indicated by setting the Major Version to
   '0', and the Minor Version to '7' (e.g. Version 0.7).

10.2  DLEP Port

   The DLEP Port TLV is a mandatory TLV in the Peer Offer signal. The
   DLEP Port TLV is used to indicate the TCP Port number on the DLEP
   server available for connections. The receiver MUST use this
   information to perform the TCP connect to the DLEP server. 

   The DLEP Port TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length=2       |       TCP Port Number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type        - TBD

   Length          - Length is 2

   TCP Port Number - TCP Port number on the DLEP server. 


10.3  Peer Type

   The Peer Type TLV is an OPTIONAL TLV in both the Peer Discovery and
   Peer Offer signals. The Peer Type TLV is used by the router and modem
   to give additional information as to its type. The peer type is a
   string and is envisioned to be used for informational purposes (e.g.
   as output in a display command).
 


Ratliff et al.           Expires April 27, 2015                [Page 18]

Internet-Draft                    DLEP                      October 2014


   The Peer Type TLV contains the following fields:

   0                   1                   2                   3
   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  |TLV Type =TBD  |Length= peer   |Peer Type String               |
  |               |type string len|                               |
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type         - TBD

   Length           - Length of peer type string.

   Peer Type String - Non-Null terminated string, using UTF-8 encoding.
                      For example, a satellite modem might set this
                      variable to 'Satellite terminal'.

10.4  MAC Address

   The MAC address TLV MUST appear in all destination-oriented signals
   (e.g. Destination Up, Destination Up ACK, Destination Down,
   Destination Down ACK, Destination Update, Link Characteristics
   Request, and Link Characteristics ACK). The MAC Address TLV contains
   the address of the destination on the remote node. The MAC address
   MAY be either a physical or a virtual destination. Examples of a
   virtual destination would be a multicast MAC address, or the
   broadcast MAC (0xFFFFFFFFFFFF).

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 6     |          MAC Address          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      MAC Address                              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    - TBD

   Length      - 6

   MAC Address - MAC Address of the destination (either physical or
                 virtual).


10.5  IPv4 Address

   The IPv4 Address TLV is an optional TLV. If supported, it MAY appear
   in Destination Up, Destination Update, Peer Initialization, and Peer
 


Ratliff et al.           Expires April 27, 2015                [Page 19]

Internet-Draft                    DLEP                      October 2014


   Update signals. When included in Destination signals, the IPv4
   Address TLV contains the IPv4 address of the destination, as well as
   a subnet mask value. In the Peer Update signal, it contains the IPv4
   address of the originator of the signal. In either case, the TLV also
   contains an indication of whether this is a new or existing address,
   or is a deletion of a previously known address.

   The IPv4 Address TLV contains the following fields:

   0                   1                   2                   3
   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  |TLV Type =TBD  |Length = 5     |   Add/Drop    | IPv4 Address  |
  |               |               |   Indicator   |
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  |            IPv4 Address                       |
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type     - TBD

   Length       - 6

   Add/Drop     - Value indicating whether this is a new or existing
                  address (0x01), or a withdrawal of an address (0x02).

   IPv4 Address - The IPv4 address of the destination or peer.

   Subnet Mask  - A subnet mask (0-32) to be applied to the IPv4
                  address.


10.6  IPv6 Address

   The IPv6 Address TLV is an optional TLV. If supported, it MAY be used
   in the Destination Up, Destination Update, Peer Initialization, and
   Peer Update Signals. When included in Destination signals, this data
   item contains the IPv6 address of the destination. In the Peer
   Discovery and Peer Update, it contains the IPv6 address of the
   originating peer. In either case, the data item also contains an
   indication of whether this is a new or existing address, or is a
   deletion of a previously known address, as well as a subnet mask.







 


Ratliff et al.           Expires April 27, 2015                [Page 20]

Internet-Draft                    DLEP                      October 2014


   The IPv6 Address TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 17    |   Add/Drop    | IPv6 Address  |
   |               |               |   Indicator   |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                IPv6 Address                   | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type     - TBD

   Length       - 17

   Add/Drop     - Value indicating whether this is a new or existing
                  address (0x01), or a withdrawal of an address (0x02).

   IPv6 Address - IPv6 Address of the destination or peer.


10.7  Maximum Data Rate (Receive)

   The Maximum Data Rate Receive (MDRR) TLV is a mandatory data item,
   used in Destination Up, Destination Update, Peer Initialization, Peer
   Update, and Link Characteristics ACK Signals to indicate the maximum
   theoretical data rate, in bits per second, that can be achieved while
   receiving data on the link. When metrics are reported via the signals
   listed above, the maximum data rate receive MUST be reported.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 8     |          MDRR (bps)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        MDRR (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           MDRR (bps)          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type          -  TBD

 


Ratliff et al.           Expires April 27, 2015                [Page 21]

Internet-Draft                    DLEP                      October 2014


   Length            -  8

   Maximum Data Rate Receive -  A 64-bit unsigned number, representing
                        the maximum theoretical data rate, in bits per
                        second (bps), that can be achieved while
                        receiving on the link.


10.8  Maximum Data Rate (Transmit)

   The Maximum Data Rate Transmit (MDRT) TLV is a mandatory data item,
   used in Destination Up, Destination Update, Peer Initialization, Peer
   Update, and Link Characteristics ACK Signals to indicate the maximum
   theoretical data rate, in bits per second, that can be achieved while
   transmitting data on the link. When metrics are reported via the
   signals listed above, the maximum data rate transmit MUST be
   reported.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 8     |          MDRT (bps)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        MDRT (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           MDRT (bps)          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type          -  TBD

   Length            -  8

   Maximum Data Rate Transmit -  A 64-bit unsigned number, representing
                        the maximum theoretical data rate, in bits per
                        second (bps), that can be achieved while
                        transmitting on the link.


10.9  Current Data Rate (Receive)

   The Current Data Rate Receive (CDRR) TLV is a mandatory data item,
   used in Destination Up, Destination Update, Peer Initialization, Peer
   Update, Link Characteristics Request, and Link Characteristics ACK
   signals to indicate the rate at which the link is currently operating
   for receiving traffic. In the case of the Link Characteristics
   Request, CDRR represents the desired receive data rate for the link.
   When metrics are reported via the signals above (e.g. Destination
   Update), the current data rate receive MUST be reported.
 


Ratliff et al.           Expires April 27, 2015                [Page 22]

Internet-Draft                    DLEP                      October 2014


   The Current Data Rate Receive TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |TLV Flags=0x10 |Length = 8     |CDRR (bps)     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        CDRR (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        CDRR (bps)             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type          -  TBD

   Length            -  8

   Current Data Rate Receive -  A 64-bit unsigned number, representing
                        the current data rate, in bits per second, that
                        is currently be achieved while receiving traffic
                        on the link. When used in the Link
                        Characteristics Request, CDRR represents the
                        desired receive rate, in bits per second, on the
                        link. If there is no distinction between current
                        and maximum receive data rates, current data
                        rate receive SHOULD be set equal to the maximum
                        data rate receive. 


10.10  Current Data Rate (Transmit)

   The Current Data Rate Receive (CDRT) TLV is a mandatory data item,
   used in Destination Up, Destination Update, Peer Initialization, Peer
   Update, Link Characteristics Request, and Link Characteristics ACK
   signals to indicate the rate at which the link is currently operating
   for transmitting traffic. In the case of the Link Characteristics
   Request, CDRT represents the desired transmit data rate for the link.
   When metrics are reported via the signals above (e.g. Destination
   Update), the current data rate transmit MUST be reported.










 


Ratliff et al.           Expires April 27, 2015                [Page 23]

Internet-Draft                    DLEP                      October 2014


   The Current Data Rate Transmit TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |TLV Flags=0x10 |Length = 8     |CDRT (bps)     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        CDRT (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        CDRT (bps)             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type          -  TBD

   Length            -  8

   Current Data Rate Transmit -  A 64-bit unsigned number, representing
                        the current data rate, in bits per second, that
                        is currently be achieved while transmitting
                        traffic on the link. When used in the Link
                        Characteristics Request, CDRT represents the
                        desired transmit rate, in bits per second, on
                        the link. If there is no distinction between
                        current and maximum transmit data rates, current
                        data rate transmit MUST be set equal to the
                        maximum data rate transmit.


10.11  Latency

   The Latency TLV is a mandatory data item. It is used in Peer
   Initialization, Destination Up, Destination Update, Peer
   Initialization, Peer Update, Link Characteristics Request, and Link
   Characteristics ACK signals to indicate the amount of latency on the
   link, or in the case of the Link Characteristics Request, to indicate
   the maximum latency required on the link. 

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 4     | Latency in microseconds       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Latency (Cont.) microsecs    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    -  TBD

   Length      -  4
 


Ratliff et al.           Expires April 27, 2015                [Page 24]

Internet-Draft                    DLEP                      October 2014


   Latency     -  A 32-bit unsigned value, representing the transmission
                  delay that a packet encounters as it is transmitted
                  over the link. In Destination Up, Destination Update,
                  and Link Characteristics ACK, this value is reported
                  as delay, in microseconds. The calculation of latency
                  is implementation dependent. For example, the latency
                  may be a running average calculated from the internal
                  queuing. If a device cannot calculate latency, this
                  TLV SHOUD NOT be issued. In the Link Characteristics
                  Request Signal, this value represents the maximum
                  delay, in microseconds, expected on the link.


10.12  Resources (Receive)

   The Receive Resources TLV is an optional data item. If supported, it
   is used in Destination Up, Destination Update, Peer Initialization,
   Peer Update, and Link Characteristics ACK signals to indicate a
   percentage (0-100) amount of resources (e.g. battery power),
   committed to receiving data, remaining on the originating peer.

   The Resources TLV contains the following fields:

    0                   1                   2             
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     | Rcv Resources|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    -  TBD

   Length      -  1

   Receive Resources   -  A percentage, 0-100, representing the amount
                  of remaining resources, such as battery power,
                  allocated to receiving data. If a device cannot
                  calculate receive resources, this TLV SHOULD NOT be
                  issued.

10.13  Resources (Transmit)

   The Transmit Resources TLV is an optional data item. If supported, it
   is used in Destination Up, Destination Update, Peer Initialization,
   Peer Update, and Link Characteristics ACK signals to indicate a
   percentage (0-100) amount of resources (e.g. battery power),
   committed to transmitting data, remaining on the originating peer.


 


Ratliff et al.           Expires April 27, 2015                [Page 25]

Internet-Draft                    DLEP                      October 2014


   The Resources TLV contains the following fields:

    0                   1                   2             
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     | Xmt Resources|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    -  TBD

   Length      -  1

   Transmit Resources   -  A percentage, 0-100, representing the amount
                  of remaining resources, such as battery power,
                  allocated to transmitting data. If the transmit
                  resources cannot be calculated, then the TLV SHOULD
                  NOT be issued.  



10.14  Relative Link Quality (Receive)

   The Relative Link Quality Receive (RLQR) TLV is an optional data
   item. If supported, it is used in Peer Initialization, Destination
   Up, Destination Update, Peer Initialization, Peer Update, and Link
   Characteristics ACK signals to indicate the quality of the link for
   receiving data as calculated by the originating peer. 

   The Relative Link Quality (Receive) TLV contains the following
   fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     |RCV Rel. Link  |
   |               |               |Quality (RLQR) |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type              -  TBD

   Length                -  1

   Relative Link Quality (Receive) -  A non-dimensional number, 1-100,
                          representing relative link quality. A value of
                          100 represents a link of the highest quality.
                          If a device cannot calculate the RLQR, this
                          TLV SHOULD NOT be issued. 

 


Ratliff et al.           Expires April 27, 2015                [Page 26]

Internet-Draft                    DLEP                      October 2014


10.15  Relative Link Quality (Transmit)

   The Transmit Link Quality Receive (RLQT) TLV is an optional data
   item. It is used in Peer Initialization, Destination Up, Destination
   Update, Peer Initialization, Peer Update, and Link Characteristics
   ACK signals to indicate the quality of the link for transmitting data
   as calculated by the originating peer. 

   The Relative Link Quality (Transmit) TLV contains the following
   fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     |XMT Rel. Link  |
   |               |               |Quality (RLQR) |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type              -  TBD

   Length                -  1

   Relative Link Quality (Transmit) -  A non-dimensional number, 1-100,
                          representing relative link quality. A value of
                          100 represents a link of the highest quality.
                          If a device cannot calculate the RLQT, this
                          TLV SHOULD NOT be issued. 


10.16  Status

   The Status TLV is sent as part of an acknowledgement signal, from
   either the modem or the router, to indicate the success or failure of
   a given request.

   The Status TLV contains the following fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     |     Code      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type         - TBD

   Length           - 1

   Termination Code - 0 = Success, Non-zero = Failure. Specific values
 


Ratliff et al.           Expires April 27, 2015                [Page 27]

Internet-Draft                    DLEP                      October 2014


                          of a non-zero termination code depend on the
                          operation requested (e.g. Destination Up,
                          Destination Down, etc).


10.17  Heartbeat Interval

   The Heartbeat Interval TLV is a mandatory TLV. It MUST be sent during
   Peer Initialization to indicate the desired Heartbeat timeout window.
   The receiver MUST either accept the timeout interval supplied by the
   sender, or reject the Peer Initialization, and close the socket.
   Implementations MUST implement heuristics such that DLEP signals
   sent/received reset the timer interval. 

   The Interval is used to specify a period (in seconds) for Heartbeat
   Signals (See Section 11.15). By specifying an Interval value of 0,
   implementations MAY indicates the desire to disable Heartbeat signals
   entirely (e.g., the Interval is set to an infinite value), however,
   it is strongly recommended that implementations use non 0 timer
   values.

   A DLEP session will be considered inactive, and MUST be torn down, by
   an implementation detecting that two (2) Heartbeat intervals have
   transpired without receipt of any DLEP signals. 

   The Heartbeat Interval TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 2     |           Interval            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type         - TBD

   Length           - 2

   Interval         - 0 = Do NOT use heartbeats on this peer-to-peer
                      session. Non-zero = Interval, in seconds, for
                      heartbeat signals.

10.18  Link Characteristics ACK Timer

   The Link Characteristics ACK Timer TLV is an optional TLV. If
   supported, it MAY be sent during Peer Initialization to indicate the
   desired number of seconds to wait for a response to a Link
   Characteristics Request. If this TLV is omitted, implementations
   supporting the Link Characteristics Request SHOULD choose a default
 


Ratliff et al.           Expires April 27, 2015                [Page 28]

Internet-Draft                    DLEP                      October 2014


   value.

   The Link Characteristics ACK Timer TLV contains the following fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     | Interval      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type     - TBD

   Length       - 1

   Interval     - 0 = Do NOT use timeouts for Link Characteristics
                  requests on this router/modem session. Non-zero =
                  Interval, in seconds, to wait before considering a
                  Link Characteristics Request has been lost.

10.19  Credit Window Status

   The Credit Window Status TLV is an optional TLV. If credits are
   supported by the DLEP participants (both the router and the modem),
   the Credit Window Status TLV MUST be sent by the participant
   receiving a Credit Grant Request for a given destination.

   The Credit Window Status TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 16    | Modem Receive Window Value    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Modem Receive Window Value                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Modem Receive Window Value   | Router Receive Window Value   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                Router Receive Window Value                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Router Receive Window Value  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type                    - TBD

   Length                      - 16

   Modem Receive Window Value  - A 64-bit unsigned number, indicating
                                 the current (or initial) number of
 


Ratliff et al.           Expires April 27, 2015                [Page 29]

Internet-Draft                    DLEP                      October 2014


                                 credits available on the Modem Receive
                                 Window.

   Router Receive Window Value - A 64-bit unsigned number, indicating
                                 the current (or initial) number of
                                 credits available on the Router Receive
                                 Window.


10.20  Credit Grant Request

   The Credit Grant Request TLV is an optional TLV. If credits are
   supported, the Credit Grant Request TLV is sent from a DLEP
   participant to grant an increment to credits on a window. The Credit
   Grant TLV is sent as a data item in either the Destination Up or
   Destination Update signals. The value in a Credit Grant TLV
   represents an increment to be added to any existing credits available
   on the window. Upon successful receipt and processing of a Credit
   Grant TLV, the receiver MUST respond with a signal containing a
   Credit Window Status TLV to report the updated aggregate values for
   synchronization purposes. 

   In the Destination Up signal, when credits are desired, the
   originating peer MUST set the initial credit value of the window it
   controls (e.g. the Modem Receive Window, or Router Receive Window) to
   an initial, non-zero value. If the receiver of a Destination Up
   signal with a Credit Grant Request TLV supports credits, the receiver
   MUST either reject the use of credits, via a Destination Up ACK
   response with the correct Status TLV, or set the initial value from
   the data contained in the Credit Window Status TLV. If the
   initialization completes successfully, the receiver MUST respond to
   the Destination Up signal with a Destination Up ACK signal that
   contains a Credit Window Status TLV, initializing its receive window.

   The Credit Grant TLV contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 8     |       Credit Increment        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Credit Increment                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Credit Increment         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type         - TBD

 


Ratliff et al.           Expires April 27, 2015                [Page 30]

Internet-Draft                    DLEP                      October 2014


   Length           - 8

   Reserved         - A 64-bit unsigned number representing the
                      additional credits to be assigned to the credit
                      window. Since credits can only be granted by the
                      receiver on a window, the applicable credit window
                      (either the MRW or the RRW) is derived from the
                      sender of the grant. The Credit Increment MUST NOT
                      cause the window to overflow; if this condition
                      occurs, implementations MUST set the credit window
                      to the maximum value contained in a 64-bit
                      quantity.


10.21  Credit Request

   The Credit Request TLV is an optional TLV. If credits are supported,
   the Credit Request TLV MAY be sent from either DLEP participant, via
   a Destination Update signal, to indicate the desire for the partner
   to grant additional credits in order for data transfer to proceed on
   the session. If the corresponding Destination Up signal for this
   session did NOT contain a Credit Window Status TLV, indicating that
   credits are to be used on the session, then the Credit Request TLV
   MUST be rejected by the receiver via a Destination Update ACK signal.

   The Credit Request TLV contains the following fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 1     | Reserved, MUST|
   |               |               | be set to 0   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type     - TBD

   Length       - 1

   Reserved     - This field is currently unused and MUST be set to 0.

10.22  DLEP Optional Signals Supported

   The DLEP Optional Signals Supported TLV is a mandatory data item. If
   optional signals (e.g., the Link Characteristics Request Signal) are
   supported, they MUST be enumerated with this data item inserted into
   the Peer Initialization and Peer Initialization ACK signals. Failure
   to indicate optional signals indicates to a receiving peer that the
   sending implementation ONLY supports the core (mandatory) items
 


Ratliff et al.           Expires April 27, 2015                [Page 31]

Internet-Draft                    DLEP                      October 2014


   listed in this specification. Optional signals that are NOT
   enumerated in this data item when issuing Peer Initialization or Peer
   Initialization ACK MUST NOT be used during the DLEP session.

   The DLEP Optional Signals Supported TLV contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 2 +   |List of optional signals ...   |
   |               |number of opt. |                               |
   |               |signals.       |                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    -  TBD

   Length      -  2 + the number of optional signals supported
   List        -  An enumeration of the optional signal TLV Types
                  supported by the implementation.

10.23  DLEP Optional Data Items Supported

   The DLEP Optional Data Items Supported TLV is a mandatory data item.
   If optional data items (e.g., Resources) are supported, they MUST be
   enumerated with this data item inserted into the Peer Initialization
   and Peer Initialization ACK signals. Failure to indicate optional
   data items indicates to a receiving peer that the sending
   implementation ONLY supports the core (mandatory) data items listed
   in this specification. Optional data items that are NOT listed in
   this data item MUST NOT be used during the DLEP session.

   The DLEP Optional Data Items Supported TLV contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD  |Length = 2 +   |List of optional data items ...|
   |               |number of opt. |                               |
   |               |signals.       |                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type    -  TBD

   Length      -  2 + the number of optional data items supported
   List        -  An enumeration of the optional data item TLV Types
                  supported by the implementation.
 


Ratliff et al.           Expires April 27, 2015                [Page 32]

Internet-Draft                    DLEP                      October 2014


10.24  DLEP Vendor Extension 

   The DLEP Vendor Extension data item is an optional data item, and
   allows for vendor-defined information to be passed between DLEP
   participants. The precise data carried in the payload portion of the
   data item is vendor-specific, however, the payload MUST adhere to a
   Type-Length-Value format. This optional data item is ONLY valid on
   Peer Initialization ACK, and if present, SHOULD contain device-
   specific information geared to optimizing data transmission/reception
   over the modem's link. 

   The DLEP Vendor Extension Data Item TLV contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type = TBD | Length        |OUI Length     | Vendor OUI... |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     OUI TLV Subtype           | Payload...                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   TLV Type        - TBD

   Length          - 3 + length of OUI (in octets) + payload length

   Vendor OUI      - The vendor OUI, as specified in [IEEE]

   OUI TLV Subtype - A 16-bit quantity, intended to indicate the        
             specific device.

   Payload         - Vendor-specific payload, formatted as Type, Length,
                     Value construct(s).


10.25  IPv4 Attached Subnet

   The DLEP IPv4 Attached Subnet is an optional data item, and allows a
   device to declare that it has an IPv4 subnet (e.g., a stub network)
   attached. If supported, the DLEP IPv4 Attached Subnet TLV is allowed
   ONLY in the DLEP "Destination Up" signal, and MUST NOT appear more
   than once. All other occurrences of the DLEP IPv4 Attached Subnet TLV
   MUST be treated as an error. Once an IPv4 Subnet has been declared by
   a device, the declaration can NOT be withdrawn without terminating
   the destination (via the "Destination Down" signal) and re-issuing
   the "Destination Up" signal.

   The DLEP IPv4 Attached Subnet data item TLV contains the following
 


Ratliff et al.           Expires April 27, 2015                [Page 33]

Internet-Draft                    DLEP                      October 2014


   fields:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD   | Length = 5    | IPv4 Attached Subnet         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv4 Attached Subnet      |  Subnet Mask |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     TLV Type     - TBD

     Length       - 5

     IPv4 Subnet  - The IPv4 subnet reachable at the destination.

     Subnet Mask  - A subnet mask (0-32) to be applied to the IPv4
                    subnet.


10.26  IPv6 Attached Subnet

   The DLEP IPv6 Attached Subnet is an optional data item, and allows a
   device to declare that it has an IPv6 subnet (e.g., a stub network)
   attached. If supported, the DLEP IPv6 Attached Subnet TLV is allowed
   ONLY in the DLEP "Destination Up" signal, and MUST NOT appear more
   than once. All other occurrences of the DLEP IPv6 Attached Subnet TLV
   MUST be treated as an error. As in the case of the IPv4 attached
   subnet, once an IPv6 attached subnet has been declared, it can NOT be
   withdrawn without terminating the destination (via "Destination
   Down") and re-issuing the "Destination Up" signal.

   The DLEP IPv6 Attached Subnet data item TLV contains the following
   fields:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |TLV Type =TBD   |Length = 17    | IPv6 Attached Subnet         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet                                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet                                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet                                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet      | Subnet Mask  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
 


Ratliff et al.           Expires April 27, 2015                [Page 34]

Internet-Draft                    DLEP                      October 2014


     TLV Type     - TBD

     Length       - 17

     IPv4 Subnet  - The IPv6 subnet reachable at the destination.

     Subnet Mask  - A subnet mask (0-128) to be applied to the IPv6     
              subnet.

11. DLEP Protocol Signals

   DLEP signals are encoded as a string of Type-Length-Value (TLV)
   constructs. The first TLV in a DLEP signal MUST be a valid DLEP
   signal, as defined in section 11.1 of this document. Following the
   signal TLV is 0 or more TLVs, representing the data items that are
   appropriate for the signal. The layout of a DLEP signal is thus:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | DLEP Signal   |DLEP Signal length (length of  |Start of DLEP  |
   | Type value    |all data items)                |data item TLVs |
   | (value TBD)   |                               |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   All DLEP signals begin with this structure. Therefore, in the
   following descriptions of specific signals, this header structure is
   assumed, and will not be replicated. 


11.1  Signal TLV Values

   As mentioned above, all DLEP signals begin with the Type value. Valid
   DLEP signals are:

          TLV      TLV
          Value    Description
          =========================================
          TBD      Peer Discovery
          TBD      Peer Offer
          TBD      Peer Initialization
          TBD      Peer Update
          TBD      Peer Update ACK
          TBD      Peer Termination
          TBD      Peer Termination ACK
          TBD      Destination Up
          TBD      Destination Up ACK
          TBD      Destination Down
 


Ratliff et al.           Expires April 27, 2015                [Page 35]

Internet-Draft                    DLEP                      October 2014


          TBD      Destination Down ACK
          TBD      Destination Update
          TBD      Heartbeat
          TBD      Link Characteristics Request
          TBD      Link Characteristics ACK

11.2 Peer Discovery Signal

   The Peer Discovery Signal is sent by a router to discover DLEP
   routers in the network. The Peer Offer signal is required to complete
   the discovery process. Implementations MAY implement their own retry
   heuristics in cases where it is determined the Peer Discovery Signal
   has timed out.

   To construct a Peer Discovery signal, the initial TLV Type value is
   set to DLEP_PEER_DISCOVERY (value TBD). The signal TLV MUST be
   followed by the mandatory Data Item TLVs.

   Mandatory Data Item TLVs:
              - DLEP Version
              - Heartbeat Interval
   There are NO optional data items for the Peer Discovery signal. 

11.3 Peer Offer Signal

   The Peer Offer Signal is sent by a DLEP modem in response to a Peer
   Discovery Signal. Upon receipt, and processing, of a Peer Offer
   signal, the router responds by issuing a TCP connect to the
   address/port combination specified in the received Peer Offer.

   The Peer Offer signal MUST be sent to the unicast address of the
   originator of Peer Discovery. 

   To construct a Peer Offer signal, the initial TLV type value is set
   to DLEP_PEER_OFFER (value TBD). The signal TLV is then followed by
   all mandatory Data Item TLVs, then by any optional Data Item TLVs the
   implementation supports:

   Mandatory Data Item TLVs:
              - DLEP Version
              - Heartbeat Interval
              - At least one (1) IPv4 or IPv6 Address TLV
              - DLEP Port

   Optional Data Item TLVs:
              - Peer Type
              - Status

 


Ratliff et al.           Expires April 27, 2015                [Page 36]

Internet-Draft                    DLEP                      October 2014


11.4 Peer Initialization Signal

   The Peer Initialization signal is sent by a router to start the DLEP
   TCP session. It is sent by the router after a TCP connect to an
   address/port combination that was obtained either via receipt of a
   Peer Offer, or from a-priori configuration. If any optional signals
   or data items are supported by the implementation, they MUST be
   enumerated in the DLEP Optional Signals Supported and DLEP Optional
   Data Items Supported items.

   Mandatory Data Item TLVs:
               - DLEP Version
               - Heartbeat Interval
               - Optional Signals Supported
               - Optional Data Items Supported
   Optional Data Item TLVs:
              - Peer Type
   If the Optional Signals Supported (or the Optional Data Items
   Supported) TLV is absent in Peer Initialization, the receiver of the
   signal MUST conclude that there is NO optional support in the
   sender.

11.5 Peer Initialization ACK Signal

   The Peer Initialization ACK signal is a mandatory signal, sent in
   response to a received Peer Initialization signal. The Peer
   Initialization ACK signal completes the TCP-level DLEP session
   establishment; the sender of the signal should transition to an "in-
   session" state when the signal is sent, and the receiver should
   transition to the "in-session" state upon receipt (and successful
   parsing) of Peer Initialization ACK. 

   All supported metric data items MUST be included in the Peer
   Initialization ACK signal, with default values to be used on a
   "modem-wide" basis. This can be viewed as the modem "declaring" all
   supported metrics at DLEP session initialization. Receipt of any DLEP
   signal containing a metric data item NOT included in Peer
   Initialization ACK MUST be treated as an error, resulting in
   termination of the DLEP session between router and modem. If optional
   signals and/or data items are supported by the modem, they MUST be
   enumerated in the DLEP Optional Signals supported and DLEP Optional
   data items supported TLVs.

   The Peer Initialization ACK signal MAY contain the DLEP Vendor
   Extension data item, as documented in section 10.22

   After the Peer Initialization/Peer Initialization ACK signals have
   been successfully exchanged, implementations SHOULD only utilize
 


Ratliff et al.           Expires April 27, 2015                [Page 37]

Internet-Draft                    DLEP                      October 2014


   options that are supported in BOTH peers (e.g. router and modem). Any
   attempt by a DLEP session peer to send an optional signal to a peer
   without support MUST result in an error which terminates the session.
   Any optional data item sent to a peer without support will be ignored
   and silently dropped. 

   To construct a Peer Initialization ACK signal, the initial TLV type
   value is set to DLEP_PEER_INIT_ACK (value TBD). The signal TLV is
   then followed by the required data items:

   Mandatory Data Item TLVs:
               - DLEP Version
               - Heartbeat Interval
               - Maximum Data Rate Receive
               - Maximum Data Rate Transmit
               - Current Data Rate Receive
               - Current Data Rate Transmit
               - DLEP Optional Signals Supported
               - DLEP Optional Data Items Supported
               - Status
   Optional Data Item TLVs:
               - Peer Type
               - DLEP Vendor Extension
               - Latency
               - Relative Link Quality Receive
               - Relative Link Quality Transmit
               - Resources (Receive)
               - Resources (Transmit)

11.6 Peer Update Signal

   The Peer Update signal is an optional signal, sent by a DLEP peer to
   indicate local Layer 3 address changes, or for metric changes on a
   modem-wide basis. For example, addition of an IPv4 address to the
   router MAY prompt a Peer Update signal to its attached DLEP modems.
   Also, a modem that changes its Maximum Data Rate for all destinations
   MAY reflect that change via a Peer Update Signal to its attached
   router(s).

   Concerning Layer 3 addresses, if the modem is capable of
   understanding and forwarding this information (via proprietary
   mechanisms), the address update would prompt any remote DLEP modems
   (DLEP-enabled modems in a remote node) to issue a "Destination
   Update" signal to their local routers with the new (or deleted)
   addresses. Modems that do not track Layer 3 addresses SHOULD silently
   parse and ignore the Peer Update Signal. Modems that track Layer 3
   addresses MUST acknowledge the Peer Update with a Peer Update ACK
   signal. Routers receiving a Peer Update with metric changes MUST
 


Ratliff et al.           Expires April 27, 2015                [Page 38]

Internet-Draft                    DLEP                      October 2014


   apply the new metric to all destinations (remote nodes) accessible
   via the modem. Supporting implementations are free to employ
   heuristics to retransmit Peer Update signals. The sending of Peer
   Update Signals for Layer 3 address changes SHOULD cease when a either
   participant (router or modem) determines that the other
   implementation does NOT support Layer 3 address tracking.

   If metrics are supplied with the Peer Update signal (e.g. Maximum
   Data Rate), these metrics are considered to be modem-wide, and
   therefore MUST be applied to all destinations in the information base
   associated with the router/modem session.

   To construct a Peer Update signal, the initial TLV type value is set
   to DLEP_PEER_UPDATE (value TBD). The Signal TLV is followed by any
   OPTIONAL Data Item TLVs.  

   Optional Data Item TLVs:
              - IPv4 Address
              - IPv6 Address
              - Maximum Data Rate (Receive)
              - Maximum Data Rate (Transmit)
              - Current Data Rate (Receive)
              - Current Data Rate (Transmit)
              - Latency
              - Resources (Receive)
              - Resources (Transmit)
              - Relative Link Quality (Receive)
              - Relative Link Quality (Transmit)

11.7 Peer Update ACK Signal

   The Peer Update ACK signal is an optional signal, and is sent by
   implementations supporting Layer 3 address tracking and/or modem-wide
   metrics to indicate whether a Peer Update Signal was successfully
   processed. If the Peer Update ACK is issued, it MUST contain a Status
   data item, indicating the success or failure of processing the
   received Peer Update. 

   To construct a Peer Update ACK signal, the initial TLV type value is
   set to DLEP_PEER_UPDATE_ACK (value TBD). The Status data item TLV is
   placed in the packet next, completing the Peer Update ACK. 

   Mandatory Data Item TLVs:

             - Status

   Note that there are NO optional data item TLVs specified for this
   signal.
 


Ratliff et al.           Expires April 27, 2015                [Page 39]

Internet-Draft                    DLEP                      October 2014


11.8 Peer Termination Signal

   The Peer Termination Signal is sent by a DLEP participant when the
   router/modem session needs to be terminated. Implementations
   receiving a Peer Termination signal MUST send a Peer Termination ACK
   signal to confirm the termination process. The sender of a Peer
   Termination signal is free to define its heuristics in event of a
   timeout. The receiver of a Peer Termination Signal MUST release all
   resources allocated for the router/modem session, and MUST eliminate
   all destinations in the information base accessible via the
   router/modem pair represented by the session. Router and modem state
   machines are returned to the "discovery" state. No Destination Down
   signals are sent.

   To construct a Peer Termination signal, the initial TLV type value is
   set to DLEP_PEER_TERMINATION (value TBD). The signal TLV is followed
   by any OPTIONAL Data Item TLVs the implementation supports:

   Optional Data Item TLVs:

             - Status

11.9 Peer Termination ACK Signal

   The Peer Termination Signal ACK is sent by a DLEP peer in response to
   a received Peer Termination order. Receipt of a Peer Termination ACK
   signal completes the teardown of the router/modem session. 

   To construct a Peer Termination ACK signal, the initial TLV type
   value is set to DLEP_PEER_TERMINATION_ACK (value TBD). The
   Identification data item TLV is placed in the packet next, followed
   by any OPTIONAL TLVs the implementation supports:

   Optional Data Item TLVs:

             - Status

11.10 Destination Up Signal

   A DLEP participant sends the Destination Up signal to report that a
   new destination has been detected. A Destination Up ACK Signal is
   required to confirm a received Destination Up. A Destination Up
   signal can be sent either by the modem, to indicate that a new remote
   node has been detected, or by the router, to indicate the presence of
   a new logical destination (e.g., a Multicast group) exists in the
   network.

   The sender of the Destination Up Signal is free to define its retry
 


Ratliff et al.           Expires April 27, 2015                [Page 40]

Internet-Draft                    DLEP                      October 2014


   heuristics in event of a timeout. When a Destination Up signal is
   received and successfully parsed, the receiver should add knowledge
   of the new destination to its information base, indicating that the
   destination is accessible via the modem/router pair.

   To construct a Destination Up signal, the initial TLV type value is
   set to DLEP_DESTINATION_UP (value TBD). The MAC Address data item TLV
   is placed in the packet next, followed by any supported optional Data
   Item TLVs into the packet:

   Optional Data Item TLVs:

              - IPv4 Address
              - IPv6 Address
              - Maximum Data Rate (Receive)
              - Maximum Data Rate (Transmit)
              - Current Data Rate (Receive)
              - Current Data Rate (Transmit)
              - Latency
              - Resources (Receive)
              - Resources (Transmit)
              - Relative Link Factor (Receive)
              - Relative Link Factor (Transmit)
              - Credit Window Status
              - IPv4 Attached Subnet
              - IPv6 Attached Subnet

11.11 Destination Up ACK Signal

   A DLEP participant sends the Destination Up ACK Signal to indicate
   whether a Destination Up Signal was successfully processed.

   To construct a Destination Up ACK signal, the initial TLV type value
   is set to DLEP_DESTINATION_UP_ACK (value TBD). The MAC Address data
   item TLV is placed in the packet next, containing the MAC address of
   the DLEP destination. The implementation would then place any
   supported optional Data Item TLVs into the packet:

   Optional Data Item TLVs:
              - Credit Window Status

11.12 Destination Down Signal

   A DLEP peer sends the Destination Down signal to report when a
   destination (a remote node or a multicast group) is no longer
   reachable. The Destination Down signal MUST contain the MAC Address
   data item TLV. Other TLVs as listed are OPTIONAL, and MAY be present
   if an implementation supports them. A Destination Down ACK Signal
 


Ratliff et al.           Expires April 27, 2015                [Page 41]

Internet-Draft                    DLEP                      October 2014


   MUST be sent by the recipient of a Destination Down signal to confirm
   that the relevant data has been removed from the information base.
   The sender of the Destination Down signal is free to define its retry
   heuristics in event of a timeout. 

   To construct a Destination Down signal, the initial TLV type value is
   set to DLEP_DESTINATION_DOWN (value TBD). The signal TLV is followed
   by the mandatory MAC Address data item TLV.

   Note that there are NO OPTIONAL data item TLVs for this signal. 

11.13 Destination Down ACK Signal

   A DLEP participant sends the Destination Down ACK Signal to indicate
   whether a received Destination Down Signal was successfully
   processed. If successfully processed, the sender of the ACK MUST have
   removed all entries in the information base that pertain to the
   referenced destination. As with the Destination Down signal, there
   are NO OPTIONAL Data Item TLVs defined for the Destination Down ACK
   signal.

   To construct a Destination Down signal, the initial TLV type value is
   set to DLEP_DESTINATION_DOWN_ACK (value TBD). The mandatory data item
   TLVs follow:

      - MAC Address Data item 
      - Status data item 

11.14 Destination Update Signal

   A DLEP participant sends the Destination Update signal when it
   detects some change in the information base for a given destination
   (remote node or multicast group). Some examples of changes that would
   prompt a Destination Update signal are:

       - Change in link metrics (e.g., Data Rates)
       - Layer 3 addressing change (for implementations that support it)


   To construct a Destination Update signal, the initial TLV type value
   is set to DLEP_DESTINATION_UPDATE (value TBD). Following the signal
   TLV are the mandatory Data Item TLVs:

   MAC Address data item TLV

   After placing the mandatory data item TLV into the packet, the
   implementation would place any supported OPTIONAL data item TLVs.
   Possible OPTIONAL data item TLVs are: 
 


Ratliff et al.           Expires April 27, 2015                [Page 42]

Internet-Draft                    DLEP                      October 2014


              - IPv4 Address
              - IPv6 Address
              - Maximum Data Rate (Receive)
              - Maximum Data Rate (Transmit)
              - Current Data Rate (Receive)
              - Current Data Rate (Transmit)
              - Latency
              - Resources (Receive)
              - Resources (Transmit)
              - Relative Link Quality (Receive)
              - Relative Link Quality (Transmit)
              - Credit Window Status
              - Credit Grant
              - Credit Request

11.15 Heartbeat Signal

   A Heartbeat Signal is sent by a DLEP participant every N seconds,
   where N is defined in the "Heartbeat Interval" field of the Peer
   Initialization signal. Note that implementations setting the
   Heartbeat Interval to 0 effectively set the interval to an infinite
   value, therefore, in those cases, this signal would NOT be sent. 

   The signal is used by participants to detect when a DLEP session
   partner (either the modem or the router) is no longer communicating.
   Participants SHOULD allow two (2) heartbeat intervals to expire with
   no traffic on the router/modem session before initiating DLEP session
   termination procedures.

   To construct a Heartbeat signal, the initial TLV type value is set to
   DLEP_PEER_HEARTBEAT (value TBD). The signal TLV is followed by the
   mandatory Heartbeat Interval/Threshold data item. 

   Note that there are NO OPTIONAL data item TLVs for this signal. 


11.16 Link Characteristics Request Signal

   The Link Characteristics Request Signal is an optional signal, and is
   sent by the router to request that the modem initiate changes for
   specific characteristics of the link. The request can reference
   either a real (e.g., a remote node), or a logical (e.g., a multicast
   group) destination within the network. 

   The Link Characteristics Request signal contains either a Current
   Data Rate (CDRR or CDRT) TLV to request a different datarate than
   what is currently allocated, a Latency TLV to request that traffic
   delay on the link not exceed the specified value, or both. A Link
 


Ratliff et al.           Expires April 27, 2015                [Page 43]

Internet-Draft                    DLEP                      October 2014


   Characteristics ACK Signal is required to complete the request.
   Implementations are free to define their retry heuristics in event of
   a timeout. Issuing a Link Characteristics Request with ONLY the MAC
   Address TLV is a mechanism a peer MAY use to request metrics (via the
   Link Characteristics ACK) from its partner.

   To construct a Link Characteristics Request signal, the initial TLV
   type value is set to DLEP_Destination_LINK_CHAR_REQ (value TBD).
   Following the signal TLV is the mandatory Data Item TLV:

   MAC Address data item TLV

   After placing the mandatory data item TLV into the packet, the
   implementation would place any supported OPTIONAL data item TLVs.
   Possible optional data item TLVs are: 

   Current Data Rate  -  If present, this value represents the NEW (or
                         unchanged, if the request is denied) Current
                         Data Rate in bits per second (bps).

   Latency            -  If present, this value represents the maximum
                         desired latency (e.g., it is a not-to-exceed
                         value) in microseconds on the link.

11.17 Link Characteristics ACK Signal

   The LInk Characteristics ACK signal is an optional signal, and is
   sent by modems supporting it to the router letting the router know
   the success or failure of a requested change in link characteristics.
    The Link Characteristics ACK signal SHOULD contain a complete set of
   metric data item TLVs. It MUST contain the same TLV types as the
   request. The values in the metric data item TLVs in the Link
   Characteristics ACK signal MUST reflect the link characteristics
   after the request has been processed.

   To construct a Link Characteristics Request ACK signal, the initial
   TLV type value is set to DLEP_Destination_LINK_CHAR_ACK (value TBD).
   Following the signal TLV is the mandatory Data Item TLV:

   MAC Address data item TLV

   After placing the mandatory data item TLV into the packet, the
   implementation would place any supported OPTIONAL data item TLVs.
   Possible OPTIONAL data item TLVs are: 

   Current Data Rate  -  If present, this value represents the requested
                         data rate in bits per second (bps).

 


Ratliff et al.           Expires April 27, 2015                [Page 44]

Internet-Draft                    DLEP                      October 2014


   Latency            -  If present, this value represents the NEW
                         maximum latency (or unchanged, if the request
                         is denied), expressed in microseconds, on the
                         link.


12.  Security Considerations

   The protocol does not contain any mechanisms for security (e.g.
   authentication or encryption). The protocol assumes that any security
   would be implemented in the underlying transport (for example, by use
   of DTLS or some other mechanism), and is therefore outside the scope
   of this document.

13.  IANA Considerations

   This section specifies requests to IANA.

13.1  Registrations

   This specification defines:

   o  A new repository for DLEP signals, with fifteen values currently
   assigned.

   o  Reservation of numbering space for Experimental DLEP signals.

   o  A new repository for DLEP Data Items, with twenty-one values
   currently assigned. 

   o  Reservation of numbering space in the Data Items repository for
   experimental data items.

   o  A request for allocation of a well-known port for DLEP
   communication.

   o  A request for allocation of a multicast address for DLEP
   discovery.


13.2  Expert Review: Evaluation Guidelines

   No additional guidelines for expert review are anticipated.


13.3  Signal TLV Type Registration

   A new repository must be created with the values of the DLEP signals.
 


Ratliff et al.           Expires April 27, 2015                [Page 45]

Internet-Draft                    DLEP                      October 2014


   Valid signals are:

       o   Peer Discovery
       o   Peer Offer
       o   Peer Initialization
       o   Peer Initialization ACK
       o   Peer Update
       o   Peer Update ACK
       o   Peer Termination
       o   Peer Termination ACK
       o   Destination Up
       o   Destination Up ACK
       o   Destination Down
       o   Destination Down ACK
       o   Destination Update
       o   Heartbeat
       o   Link Characteristics Request
       o   Link Characteristics ACK

   It is also requested that the repository contain space for
   experimental signal types.


13.4  DLEP Data Item Registrations

   A new repository for DLEP Data Items must be created. Valid Data
   Items are:

       o   DLEP Version
       o   Peer Type 
       o   MAC Address
       o   IPv4 Address
       o   IPv6 Address
       o   Maximum Data Rate (Receive)
       o   Maximum Data Rate (Transmit)
       o   Current Data Rate (Receive)
       o   Current Data Rate (Transmit)
       o   Latency
       o   Resources (Receive)
       o   Resources (Transmit)
       o   Relative Link Quality (Receive)
       o   Relative Link Quality (Transmit)
       o   Status
       o   Heartbeat Interval/Threshold
       o   Link Characteristics ACK Timer
       o   Credit Window Status
       o   Credit Grant
       o   Credit Request
 


Ratliff et al.           Expires April 27, 2015                [Page 46]

Internet-Draft                    DLEP                      October 2014


       o   DLEP Optional Signals Supported
       o   DLEP Optional Data Items Supported
       o   DLEP Vendor Extension

   It is also requested that the registry allocation contain space for
   experimental data items. 

13.5  DLEP Well-known Port

   It is requested that IANA allocate a well-known port number for DLEP
   communication.

13.6  DLEP Multicast Address

   It is requested that IANA allocate a multicast address for DLEP
   discovery signals. 

14. Appendix A.


14.1  Peer Level Signal Flows


14.1.1  Router Device Restarts Discovery

   Router                    Modem   Signal Description
   ====================================================================

   --------Peer Discovery-------->    Router initiates discovery


    <--------Peer Offer------------   Modem detects a problem, sends
      w/ Non-zero Status TLV          Peer Offer w/Status TLV indicating
                                      the error.

                                      Router accepts failure, restarts
                                      discovery process.

   --------Peer Discovery-------->    Router initiates discovery


    <--------Peer Offer------------   Modem accepts, sends Peer Offer 
                                      w/Zero Status TLV indicating
                                      success.

                                      Discovery completed.


 


Ratliff et al.           Expires April 27, 2015                [Page 47]

Internet-Draft                    DLEP                      October 2014


14.1.2  Router Device Detects Peer Offer Timeout

   Router                    Modem   Signal Description
   ====================================================================

   --------Peer Discovery-------->    Router initiates discovery, starts
                                      a guard timer.

                                      Router guard timer expires. Router
                                      restarts discovery process.

    --------Peer Discovery-------->   Router initiates discovery, starts
                                      a guard timer.

    <--------Peer Offer------------   Modem accepts, sends Peer Offer
                                      w/Zero Status TLV indicating
                                      success.

                                      Discovery completed.





























 


Ratliff et al.           Expires April 27, 2015                [Page 48]

Internet-Draft                    DLEP                      October 2014


14.1.3  Router Peer Offer Lost

   Router                    Modem   Signal Description
   ====================================================================

   <-------Peer Discovery---------    Modem initiates discovery, starts
                                      a guard timer.

    ---------Peer Offer-------||      Router offers availability

                                      Modem times out on Peer Offer,
                                      restarts discovery process.

   <-------Peer Discovery---------    Modem initiates discovery

    ---------Peer Offer----------->   Router detects subsequent
                                      discovery, internally terminates
                                      the previous, accepts the new
                                      association, sends Peer Offer
                                      w/Status TLV indicating success.


                                      Discovery completed.


14.1.4  Discovery Success

   Router                    Modem   Signal Description
   ====================================================================

   <-------Peer Discovery---------    Modem initiates discovery

    ---------Peer Offer----------->   Router offers availability

    <-----Peer Initialization------    Modem Connects on TCP Port

    <------Peer Heartbeat----------

   -------Peer Heartbeat--------->

   <==============================>   Signal flow about destinations    
                                 (i.e. Destination Up, Destination      
                               Down, Destination update)

   <-------Peer Heartbeat---------

    -------Peer Heartbeat--------->

 


Ratliff et al.           Expires April 27, 2015                [Page 49]

Internet-Draft                    DLEP                      October 2014


    --------Peer Term Req--------->   Terminate Request

   <--------Peer Term Res---------    Terminate Response

14.1.5  Router Detects a Heartbeat timeout

   Router                    Modem   Signal Description
   ====================================================================

   <-------Peer Heartbeat---------

    -------Peer Heartbeat--------->

      ||---Peer Heartbeat---------

           ~ ~ ~ ~ ~ ~ ~

    -------Peer Heartbeat--------->

      ||---Peer Heartbeat---------
                                      Router Heartbeat Timer expires,
                                      detects missing heartbeats. Router
                                      takes down all destination sessions
                                      and terminates the Peer
                                      association.

    ------Peer Terminate --------->   Peer Terminate Request

                                      Modem takes down all destination
                                      sessions, then acknowledges the
                                      Peer Terminate

   <----Peer Terminate ACK---------   Peer Terminate ACK

14.1.6  Modem Detects a Heartbeat timeout

   Router                    Modem   Signal Description
   ====================================================================

   <-------Peer Heartbeat---------

    -------Peer Heartbeat------||

   <-------Peer Heartbeat---------

           ~ ~ ~ ~ ~ ~ ~

    -------Peer Heartbeat------||
 


Ratliff et al.           Expires April 27, 2015                [Page 50]

Internet-Draft                    DLEP                      October 2014


   <-------Peer Heartbeat---------
                                      Modem Heartbeat Timer expires,
                                      detects missing heartbeats. Modem
                                      takes down all destination sessions

    <-------Peer Terminate--------    Peer Terminate Request

                                      Router takes down all destination
                                      sessions, then acknowledges the
                                      Peer Terminate

    ------Peer Terminate ACK----->    Peer Terminate ACK




14.1.7  Peer Terminate (from Modem) Lost

   Router                    Modem   Signal Description
   ====================================================================

     ||------Peer Terminate--------   Modem Peer Terminate Request

                                      Router Heartbeat times out,
                                      terminates association.

    --------Peer Terminate------->    Router Peer Terminate

    <-----Peer Terminate ACK------    Modem sends Peer Terminate ACK



14.1.8  Peer Terminate (from Router) Lost

   Router                    Modem   Signal Description
   ====================================================================

    -------Peer Terminate-------->    Router Peer Terminate Request

                                      Modem HB times out,
                                      terminates association.

    <------Peer Terminate--------     Modem Peer Terminate

    ------Peer Terminate ACK----->    Peer Terminate ACK


14.2  Destination Specific Signal Flows
 


Ratliff et al.           Expires April 27, 2015                [Page 51]

Internet-Draft                    DLEP                      October 2014


14.2.1  Modem Destination Up Lost

   Router                    Modem   Signal Description
   ====================================================================

    ||-----Destination Up ------------   Modem sends Destination Up

                                      Modem timesout on ACK

    <------Destination Up ------------   Modem sends Destination Up

    ------Destination Up ACK--------->   Router accepts the destination
                                      session

   <------Destination Update---------    Modem Destination Metrics
          . . . . . . . .
   <------Destination Update---------    Modem Destination Metrics



14.2.2  Router Detects Duplicate Destination Ups

   Router                    Modem   Signal Description
   ====================================================================

    <------Destination Up ------------   Modem sends Destination Up

    ------Destination Up ACK-------||    Router accepts the destination
                                      session

                                      Modem timesout on ACK

    <------Destination Up ------------   Modem resends Destination Up

                                      Router detects duplicate
                                      Destination, takes down the
                                      previous, accepts the new
                                      Destination.

    ------Destination Up ACK--------->   Router accepts the destination
                                      session

   <------Destination Update---------    Modem Destination Metrics
          . . . . . . . .
   <------Destination Update---------    Modem Destination Metrics



 


Ratliff et al.           Expires April 27, 2015                [Page 52]

Internet-Draft                    DLEP                      October 2014


14.2.3  Destination Up, No Layer 3 Addresses

   Router                    Modem    Signal Description
   ====================================================================

    <------Destination Up ------------   Modem sends Destination Up

    ------Destination Up ACK--------->   Router accepts the destination
                                      session

                                      Router ARPs for IPv4 if defined.
                                      Router drives ND for IPv6 if
                                      defined.

   <------Destination Update---------    Modem Destination Metrics
          . . . . . . . .
   <------Destination Update---------    Modem Destination Metrics


14.2.4  Destination Up with IPv4, No IPv6

   Router                    Modem   Signal Description
   ====================================================================

    <------Destination Up ------------   Modem sends Destination Up with
                                      the IPv4 TLV

    ------Destination Up ACK--------->   Router accepts the destination
                                      session

                                      Router drives ND for IPv6 if
                                      defined.

   <------Destination Update---------    Modem Destination Metrics
          . . . . . . . .
   <------Destination Update---------    Modem Destination Metrics


14.2.5  Destination Up with IPv4 and IPv6

   Router                    Modem   Signal Description
   ====================================================================

    <------Destination Up ------------   Modem sends Destination Up with
                                      the IPv4 and IPv6 TLVs

    ------Destination Up ACK--------->   Router accepts the destination
                                      session
 


Ratliff et al.           Expires April 27, 2015                [Page 53]

Internet-Draft                    DLEP                      October 2014


   <------Destination Update---------    Modem Destination Metrics
          . . . . . . . .


14.2.6  Destination Session Success

   Router                    Modem   Signal Description
   ====================================================================


    ---------Peer Offer----------->   Router offers availability

    -------Peer Heartbeat--------->


   <------Destination Up -----------      Modem

    ------Destination Up ACK-------->     Router

   <------Destination Update---------     Modem
          . . . . . . . .
   <------Destination Update---------     Modem

                                       Modem initiates the terminate

   <------Destination Down ----------     Modem

    ------Destination Down ACK------->    Router

                                       or

                                       Router initiates the terminate

    ------Destination Down ---------->    Router

   <------Destination Down ACK-------     Modem


Acknowledgements

   The authors would like to acknowledge and thank the members of the
   DLEP design team, who have provided invaluable insight. The members
   of the design team are:  Teco Boot, Bow-Nan Cheng, John Dowdell,
   Henning Rogge, and Rick Taylor.

   The authors would also like to acknowledge the influence and
   contributions of Chris Olsen, Martin Duke, Subir Das, Jaewon Kang,
   Vikram Kaul, and Nelson Powell.
 


Ratliff et al.           Expires April 27, 2015                [Page 54]

Internet-Draft                    DLEP                      October 2014


Normative References

   [RFC5578] Berry, B., Ed., "PPPoE with Credit Flow and Metrics",
             RFC 5578, February 2010.

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate

   [IEEE]    http://standards.ieee.org/develop/regauth/oui/index.html

Informative References

   [TLS]  Dierks, T. and Rescorla, E. "The Transport Layer Security 
          (TLS) Protocol", RFC 5246, August 2008.


Author's Addresses

   Stan Ratliff
   Independent Consultant
   USA
   EMail: ratliffstan@gmail.com

   Bo Berry
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA
   EMail:

   Greg Harrison
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA
   EMail: greharri@cisco.com

   Shawn Jury
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA
   Email: sjury@cisco.com

   Darryl Satterwhite
   Broadcom
   USA
   Email: dsatterw@broadcom.com




Ratliff et al.           Expires April 27, 2015                [Page 55]
